app/controllers/articles_controller.rb

  def create
    @article = Article.new(params[:article])
    @article.save
---
INSERT INTO "articles" ("body", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["body", nil], ["created_at", Sun, 09 Jun 2013 20:20:31 UTC +00:00], ["title", "Another Sample Title"], ["updated_at", Sun, 09 Jun 2013 20:20:31 UTC +00:00]]

  def update
    @article = Article.find(params[:id])
    @article.update_attributes(params[:article])
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", "5"]]
UPDATE "articles" SET "image_file_name" = 'beast.png', "image_content_type" = 'image/png', "image_file_size" = 27720, "image_updated_at" = '2013-06-10 22:03:11.234144', "updated_at" = '2013-06-10 22:03:11.235858' WHERE "articles"."id" = 1