app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(params[:comment])
    @comment.article_id = params[:article_id]

    @comment.save
---
INSERT INTO "comments" ("article_id", "author_name", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["article_id", 1], ["author_name", "test comment"], ["body", "eeee"], ["created_at", Mon, 10 Jun 2013 01:29:38 UTC +00:00], ["updated_at", Mon, 10 Jun 2013 01:29:38 UTC +00:00]]